w09d04/app/controllers/bakeries_controller.rb

  def index
    @bakeries = Bakery.all
---
SELECT "bakeries".* FROM "bakeries"

    def set_bakery
      @bakery = Bakery.find(params[:id])
---
SELECT  "bakeries".* FROM "bakeries" WHERE "bakeries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]