w09d04/app/controllers/chefs_controller.rb

  def index
    @chefs = Chef.all
---
SELECT "chefs".* FROM "chefs"